*&---------------------------------------------------------------------*
*& Report ZABAP_JHY_07_09
*&---------------------------------------------------------------------*
*& ALV Grid 예제 3 ( 종합 활용 )
*&---------------------------------------------------------------------*
REPORT zabap_jhy_07_09 MESSAGE-ID zabap_jhy_msg.


*----------------------------------------------------------------------*
* INCLUDE
*----------------------------------------------------------------------*
INCLUDE zabap_jhy_07_09_t01. " 전역변수
INCLUDE zabap_jhy_07_09_scr. " Selection Screen
INCLUDE zabap_jhy_07_09_cls. " Local Class
INCLUDE zabap_jhy_07_09_pbo. " Process Before Output
INCLUDE zabap_jhy_07_09_pai. " Process After  Input
INCLUDE zabap_jhy_07_09_f01. " FORM Subroutines


*----------------------------------------------------------------------*
* Initialization
*----------------------------------------------------------------------*
INITIALIZATION.

  tx_radio = '필드 카탈로그 구현방법'(s02).
  tx_struc = 'Structure를 활용한 방법'(s03).
  tx_direc = '직접 Field Catalog를 생성한 방법'(s04).
  tx_func  = '함수를 이용해 Field Catalog를 생성하는 방법'(s05).

*----------------------------------------------------------------------*
* At Selection-screen Output
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.

*----------------------------------------------------------------------*
* At Selection-screen
*----------------------------------------------------------------------*
AT SELECTION-SCREEN.

*----------------------------------------------------------------------*
* Start-of-selection
*----------------------------------------------------------------------*
START-OF-SELECTION.

  " 데이터를 조회한다.
  PERFORM selected_data_rtn.

  " 데이터를 출력한다.
  CALL SCREEN 0100.
