*&---------------------------------------------------------------------*
*& Report ZABAP_JHY_02_01
*&---------------------------------------------------------------------*
*& 조건문 IF 문 연습
*&---------------------------------------------------------------------*
REPORT ZABAP_JHY_02_01.

PARAMETERS PA_INT TYPE I.



IF PA_INT > 0 . " PA_INT 가 0 보다 크다면,

  WRITE / 'PA_INT가 0보다 크다.'.


ELSEIF PA_INT = 0. " PA_INT 가 0 과 같다면,

  WRITE / 'PA_INT가 0과 같다.'.


ELSE. " IF 조건 또는 ELSEIF 조건이 모두 성립되지 않았다면,
  WRITE / 'PA_INT는 0보다 크지 않고, 0과 같지도 않다.'.

ENDIF.
